---
kind: property
id: P:Autodesk.Revit.DB.Rectangle.Top
source: html/197a06fc-da1f-45a3-01e8-b40c6d0f0134.htm
---
# Autodesk.Revit.DB.Rectangle.Top Property

The y-coordinate of the top-left corner of the rectangle.

## Syntax (C#)
```csharp
public int Top { get; set; }
```